---
kind: type
id: T:Autodesk.Revit.DB.OverridePermissions
source: html/cd85b605-21f5-36b5-a685-d27e0e30a5b0.htm
---
# Autodesk.Revit.DB.OverridePermissions

Types of overrides that can be applied to a category.

## Syntax (C#)
```csharp
public enum OverridePermissions
```